Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin
A plugin for implementing a home screen extension

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.#ctor
Default constructor for a HomeScreenExtensionPlugin

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.FrameUrl
The URL for the iframe to display.

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.GetErrorHtml(Autodesk.Navisworks.Api.Plugins.HomeScreenError)
The HTML to load in the iframe if the FrameUrl cannot be loaded.

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.GetHostObjectOrigins
Returns the host object origins.
Returns: The host object origins

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.HostObject
The host object for the iframe.

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.HostObjectName
The name to access HostObject.

Autodesk.Navisworks.Api.Plugins.HomeScreenExtensionPlugin.SetHostObjectOrigins(System.String[])
Sets the host object origins. The host object is only accessible if the
iframe's origin matches one of the provided origins (for security reasons).
Returns: The host object origins